# SimpleArc Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..SimpleArc Property
RebarShape Class See Also
---
Check whether this shape consists of a single arc, possibly with hooks.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public bool SimpleArc { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SimpleArc As Boolean
	Get
```

Visual C++
---
```text
public:
property bool SimpleArc {
	bool get ();
}
```

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace